[
  {
    "slug": "/bab-1/definisi-dan-karakteristik-utama-shorts",
    "title": "Definisi dan Karakteristik Utama dari Shorts",
    "description": "",
    "content": "Video pendek secara definitif adalah konten audiovisual dengan durasi yang sangat singkat, umumnya di bawah tiga menit, yang dirancang untuk konsumsi cepat, terutama pada perangkat seluler. Platform-platform populer seperti *TikTok, Instagram Reels,* dan *Youtube Shorts* secara spesifik membatasi durasi maksimal konten mereka, berkisar antara **60 detik hingga 3 menit**, untuk menjaga dinamika konsumsi konten yang serba cepat.\n\nKarakteristik utama yang membedakan video pendek dari format lainnya adalah :\n\n* Durasi singkat dan padat: Pesan disampaikan secara ringkas, lugas, dan langsung ke inti permasalahan. Format ini memaksa kreator untuk menyaring informasi dan hanya menyajikan hal-hal yang paling esensial\n* Format Vertikal: Sebagian besar video pendek dioptimalkan untuk tampilan layar ponsel yang umum dengan rasio aspek 9:16, menciptakan pengalaman menonton yang imersif dan memenuhi seluruh layar pengguna tanpa perlu memutar perangkat\n* Kombinasi Audio-Visual yang kaya: Video pendek secara efektif menggabungkan elemen gambar bergerak, teks di layar, narasi suara, dan musik latar untuk menarik dan mempertahankan perhatian audiens secara maksimal.\n* Potensi Viralitas Tinggi: Desainnya yang mudah dikonsumsi dan dibagikan melalui berbagai platfom media sosial dan aplikasi pesan meningkatkan potensi jangkauan konten secara eksponensial.\n* Biaya Produksi Rendah: Salah satu keunggulan terbesarnya adalah aksesibilitas. Video pendek berkualitas dapat diproduksi dengan peralatan yang relatif sederhana seperti *smartphone,* tanpa memerlukan studio atau tim produksi yang besar, sehingga sangat terjangkau bagi para guru.\n",
    "_searchMeta": {
      "cleanContent": "video pendek secara definitif adalah konten audiovisual dengan durasi yang sangat singkat umumnya di bawah tiga menit yang dirancang untuk konsumsi cepat terutama pada perangkat seluler platform-platform populer seperti tiktok instagram reels dan youtube shorts secara spesifik membatasi durasi maksimal konten mereka berkisar antara 60 detik hingga 3 menit untuk menjaga dinamika konsumsi konten yang serba cepat karakteristik utama yang membedakan video pendek dari format lainnya adalah : durasi singkat dan padat: pesan disampaikan secara ringkas lugas dan langsung ke inti permasalahan format ini memaksa kreator untuk menyaring informasi dan hanya menyajikan hal-hal yang paling esensial format vertikal: sebagian besar video pendek dioptimalkan untuk tampilan layar ponsel yang umum dengan rasio aspek 9:16 menciptakan pengalaman menonton yang imersif dan memenuhi seluruh layar pengguna tanpa perlu memutar perangkat kombinasi audio-visual yang kaya: video pendek secara efektif menggabungkan elemen gambar bergerak teks di layar narasi suara dan musik latar untuk menarik dan mempertahankan perhatian audiens secara maksimal potensi viralitas tinggi: desainnya yang mudah dikonsumsi dan dibagikan melalui berbagai platfom media sosial dan aplikasi pesan meningkatkan potensi jangkauan konten secara eksponensial biaya produksi rendah: salah satu keunggulan terbesarnya adalah aksesibilitas video pendek berkualitas dapat diproduksi dengan peralatan yang relatif sederhana seperti smartphone tanpa memerlukan studio atau tim produksi yang besar sehingga sangat terjangkau bagi para guru",
      "headings": [],
      "keywords": [
        "60 detik hingga 3 menit"
      ]
    }
  },
  {
    "slug": "/bab-1",
    "title": "Apa itu Shorts?",
    "description": "Bab ini bertujuan memberikan pemahaman fundamental tentang apa itu video pendek, mengapa format ini sangat dominan di lanskap media saat ini, dan bagaimana memposisikannya secara strategis dibandingkan dengan video berdurasi panjang dalam konteks pendidikan.",
    "content": "",
    "_searchMeta": {
      "cleanContent": "",
      "headings": [],
      "keywords": []
    }
  },
  {
    "slug": "/bab-1/psikologi-dibalik-dominasi-video-pendek",
    "title": "Psikologi di Balik Dominasi Video Pendek",
    "description": "",
    "content": "Popularitas masif video pendek bukanlah sebuah kebetulan, melainkan hasil dari keselarasan format ini dengan cara kerja psikologi manusia modern, khususnya generasi muda. Beberapa faktor kunci yang mendorong dominasinya antara lain:\n\n* Menyesuaikan dengan Rentang Perhatian (Attention Span) Modern: Di era digital yang dibanjiri informasi, rentang perhatiawn manusia cenderung semakin pendek. Sebuah studi menunjukkan bahwa rata-rata attention span efektif hanya sekitar 47 detik. Video pendek yang menyajikan informasi dalam \"ledakan\" singkat sangat cocok dengan kapasitas perhatian ini, memastikan pesan utama tersampaikan sebelum audiens kehilangan fokus.\n* Daya Tarik Visual dan Emosional yang Kuat: Otak manusia memproses informasi visual jauh lebih cepat daripada teks. Video, dengan kemampuannya menggabungkan narasi visual, musik, dan dialog, mampu membangkitkan respons emosional dan menciptakan ikatan yang lebih kuat dengan audiens dibandingkan gambar statis atau tulisan.\n* Gratifikasi Instan (Instant Gratification): Platform seperti TikTok dan Instagram Reels dirancang dengan mekanisme scrolling tanpa henti. Setiap usapan jari menyajikan konten baru yang memberikan stimulus dan kepuasan instan, menciptakan siklus keterlibatan yang membuat pengguna sulit berhenti.\n* Didorong oleh Algoritma Cerdas: Platform video pendek menggunakan algoritma yang sangat canggih untuk mempersonalisasi konten yang ditampilkan kepada setiap pengguna. Algoritma ini memprioritaskan video dengan tingkat keterlibatan (suka, komentar, bagikan) yang tinggi, sehingga konten yang menarik dapat dengan cepat menjadi viral dan menjangkau audiens yang sangat luas.\n\nFenomena ini mencerminkan pergeseran fundamental dalam cara generasi Z mengonsumsi informasi. Pola konsumsi ini beralih dari sesi belajar mendalam dan panjang (seperti membaca satu bab buku) menjadi \"camilan informasi\" (information snacking) yang cepat, visual, dan sesuai permintaan. Bagi para pendidik, memahami pergeseran ini adalah kunci. Mengabaikan format video pendek sama artinya dengan mengabaikan \"bahasa\" utama yang digunakan siswa untuk belajar dan berinteraksi di luar lingkungan sekolah.\n",
    "_searchMeta": {
      "cleanContent": "popularitas masif video pendek bukanlah sebuah kebetulan melainkan hasil dari keselarasan format ini dengan cara kerja psikologi manusia modern khususnya generasi muda beberapa faktor kunci yang mendorong dominasinya antara lain: menyesuaikan dengan rentang perhatian attention span modern: di era digital yang dibanjiri informasi rentang perhatiawn manusia cenderung semakin pendek sebuah studi menunjukkan bahwa rata-rata attention span efektif hanya sekitar 47 detik video pendek yang menyajikan informasi dalam ledakan singkat sangat cocok dengan kapasitas perhatian ini memastikan pesan utama tersampaikan sebelum audiens kehilangan fokus daya tarik visual dan emosional yang kuat: otak manusia memproses informasi visual jauh lebih cepat daripada teks video dengan kemampuannya menggabungkan narasi visual musik dan dialog mampu membangkitkan respons emosional dan menciptakan ikatan yang lebih kuat dengan audiens dibandingkan gambar statis atau tulisan gratifikasi instan instant gratification : platform seperti tiktok dan instagram reels dirancang dengan mekanisme scrolling tanpa henti setiap usapan jari menyajikan konten baru yang memberikan stimulus dan kepuasan instan menciptakan siklus keterlibatan yang membuat pengguna sulit berhenti didorong oleh algoritma cerdas: platform video pendek menggunakan algoritma yang sangat canggih untuk mempersonalisasi konten yang ditampilkan kepada setiap pengguna algoritma ini memprioritaskan video dengan tingkat keterlibatan suka komentar bagikan yang tinggi sehingga konten yang menarik dapat dengan cepat menjadi viral dan menjangkau audiens yang sangat luas fenomena ini mencerminkan pergeseran fundamental dalam cara generasi z mengonsumsi informasi pola konsumsi ini beralih dari sesi belajar mendalam dan panjang seperti membaca satu bab buku menjadi camilan informasi information snacking yang cepat visual dan sesuai permintaan bagi para pendidik memahami pergeseran ini adalah kunci mengabaikan format video pendek sama artinya dengan mengabaikan bahasa utama yang digunakan siswa untuk belajar dan berinteraksi di luar lingkungan sekolah",
      "headings": [],
      "keywords": []
    }
  },
  {
    "slug": "/bab-2",
    "title": "Peran Strategis Video Pendek dalam Inovasi Media Pembelajaran",
    "description": "Bab ini bertujuan memberikan pemahaman fundamental tentang apa itu video pendek, mengapa format ini sangat dominan di lanskap media saat ini, dan bagaimana memposisikannya secara strategis dibandingkan dengan video berdurasi panjang dalam konteks pendidikan.",
    "content": "",
    "_searchMeta": {
      "cleanContent": "",
      "headings": [],
      "keywords": []
    }
  },
  {
    "slug": "/bab-2/teori-beban-kognitif",
    "title": "Selaras dengan Cara Otak Belajar: Mengelola Beban Kognitif Siswa",
    "description": "",
    "content": "",
    "_searchMeta": {
      "cleanContent": "",
      "headings": [],
      "keywords": []
    }
  },
  {
    "slug": "/bab-3",
    "title": "Untitled",
    "description": "",
    "content": "",
    "_searchMeta": {
      "cleanContent": "",
      "headings": [],
      "keywords": []
    }
  },
  {
    "slug": "/bab-3/tahap-pasca-produksi",
    "title": "Tahap Pasca-Produksi (Editing menggunakan CapCut)",
    "description": "",
    "content": "Capcut adalah aplikasi **editor video gratis** yang populer untuk membuat video pendek, terutama bagi pengguna TikTok dan Instagram. Aplikasi ini mudah digunakan dan menyediakan berbagai fitur pengeditan yang lengkap (seperti trim, teks, filter, musik, dan lainnya) sehingga cocok untuk pemula maupun pengguna berpengalaman.\n\n## Instalasi dan Antarmuka CapCut\n\n## Membuat Proyek Baru di CapCut\n\n## Proses Editing di CapCut\n\n## Glosarium\n\n| No | Istilah (English/Indonesia) | Penjelasan |\r\n|----|------------------------------|-------------|\r\n| 1 | **Timeline** | Area kerja utama tempat klip video, audio, teks, dan efek disusun berdasarkan waktu. Semua proses edit dilakukan di sini. |\r\n| 2 | **Clip (Klip)** | Potongan video atau gambar yang diimpor ke proyek. Bisa berupa rekaman, foto, atau video dari sumber lain. |\r\n| 3 | **Project (Proyek)** | File kerja yang menyimpan seluruh susunan klip, efek, dan pengaturan video. Dapat dibuka kembali untuk diedit. |\r\n| 4 | **Trim (Memangkas)** | Menghapus bagian awal atau akhir dari klip tanpa memecahnya menjadi dua. |\r\n| 5 | **Split (Membagi)** | Memotong satu klip menjadi dua bagian di posisi tertentu pada timeline. |\r\n| 6 | **Cut / Delete (Potong / Hapus)** | Menghilangkan sebagian atau seluruh klip dari timeline. *Cut* dapat memindahkan, *Delete* hanya menghapus. |\r\n| 7 | **Layer (Lapisan)** | Setiap elemen (video, teks, musik, efek) berada di lapisan terpisah; lapisan atas tampil di depan. |\r\n| 8 | **Transition (Transisi)** | Efek perpindahan antar dua klip agar tidak terlihat kasar (misal: Fade, Slide, Zoom). |\r\n| 9 | **Filter** | Efek warna atau tone untuk mengubah suasana visual video. |\r\n| 10 | **Effect (Efek)** | Efek visual khusus seperti Glitch, Blur, Slow Motion, atau Shake. |\r\n| 11 | **Text / Subtitle (Teks / Subtitel)** | Tulisan yang ditambahkan pada video sebagai judul, keterangan, atau penjelasan. |\r\n| 12 | **Sticker / Element (Stiker / Elemen)** | Gambar atau animasi kecil yang ditempel pada video untuk mempercantik atau memperjelas pesan. |\r\n| 13 | **Animation (Animasi)** | Gerakan otomatis yang diterapkan pada teks, gambar, atau klip (fade in, slide, bounce). |\r\n| 14 | **Overlay (Tumpukan)** | Lapisan tambahan video atau gambar di atas klip utama. |\r\n| 15 | **Keyframe** | Titik kontrol animasi yang memungkinkan objek bergerak atau berubah seiring waktu. |\r\n| 16 | **Audio Track (Trek Audio)** | Jalur di timeline yang berisi musik, efek suara, atau narasi. |\r\n| 17 | **Voice Over (Narasi Suara)** | Rekaman suara tambahan untuk menjelaskan isi video. |\r\n| 18 | **Fade In / Fade Out** | Efek muncul atau hilangnya video/audio secara perlahan. |\r\n| 19 | **Speed (Kecepatan)** | Mengatur kecepatan video; digunakan untuk slow motion atau time lapse. |\r\n| 20 | **Crop (Pangkas Tampilan)** | Menghapus sebagian area video untuk fokus pada bagian tertentu. |\r\n| 21 | **Aspect Ratio (Rasio Aspek)** | Perbandingan lebar dan tinggi video (misal: 16:9, 9:16, 1:1). |\r\n| 22 | **Resolution (Resolusi)** | Jumlah piksel dalam video; semakin tinggi resolusi, semakin tajam hasilnya. |\r\n| 23 | **Export / Render (Ekspor / Proses Akhir)** | Menghasilkan file video jadi dari proyek yang telah diedit. |\r\n| 24 | **Preview (Pratinjau)** | Menampilkan hasil sementara sebelum ekspor. |\r\n| 25 | **Template (Templat)** | Desain atau susunan video siap pakai yang bisa diisi dengan konten sendiri. |\r\n| 26 | **Mask** | Menyembunyikan atau menampilkan sebagian klip menggunakan bentuk tertentu (lingkaran, persegi, gradasi). |\r\n| 27 | **Background Remover / Chroma Key** | Menghapus latar belakang (biasanya hijau) dan menggantinya dengan gambar lain. |\r\n| 28 | **Stabilization (Penstabilan)** | Mengurangi goyangan kamera agar video tampak lebih halus. |\r\n| 29 | **Auto Captions (Teks Otomatis)** | Fitur yang otomatis menulis teks berdasarkan ucapan dalam video. |\r\n| 30 | **Draft (Draf)** | Proyek sementara yang belum diekspor dan masih dapat diedit kembali. |\n",
    "_searchMeta": {
      "cleanContent": "capcut adalah aplikasi editor video gratis yang populer untuk membuat video pendek terutama bagi pengguna tiktok dan instagram aplikasi ini mudah digunakan dan menyediakan berbagai fitur pengeditan yang lengkap seperti trim teks filter musik dan lainnya sehingga cocok untuk pemula maupun pengguna berpengalaman instalasi dan antarmuka capcut membuat proyek baru di capcut proses editing di capcut glosarium no istilah english indonesia penjelasan ---- ------------------------------ ------------- 1 timeline area kerja utama tempat klip video audio teks dan efek disusun berdasarkan waktu semua proses edit dilakukan di sini 2 clip klip potongan video atau gambar yang diimpor ke proyek bisa berupa rekaman foto atau video dari sumber lain 3 project proyek file kerja yang menyimpan seluruh susunan klip efek dan pengaturan video dapat dibuka kembali untuk diedit 4 trim memangkas menghapus bagian awal atau akhir dari klip tanpa memecahnya menjadi dua 5 split membagi memotong satu klip menjadi dua bagian di posisi tertentu pada timeline 6 cut delete potong hapus menghilangkan sebagian atau seluruh klip dari timeline cut dapat memindahkan delete hanya menghapus 7 layer lapisan setiap elemen video teks musik efek berada di lapisan terpisah lapisan atas tampil di depan 8 transition transisi efek perpindahan antar dua klip agar tidak terlihat kasar misal: fade slide zoom 9 filter efek warna atau tone untuk mengubah suasana visual video 10 effect efek efek visual khusus seperti glitch blur slow motion atau shake 11 text subtitle teks subtitel tulisan yang ditambahkan pada video sebagai judul keterangan atau penjelasan 12 sticker element stiker elemen gambar atau animasi kecil yang ditempel pada video untuk mempercantik atau memperjelas pesan 13 animation animasi gerakan otomatis yang diterapkan pada teks gambar atau klip fade in slide bounce 14 overlay tumpukan lapisan tambahan video atau gambar di atas klip utama 15 keyframe titik kontrol animasi yang memungkinkan objek bergerak atau berubah seiring waktu 16 audio track trek audio jalur di timeline yang berisi musik efek suara atau narasi 17 voice over narasi suara rekaman suara tambahan untuk menjelaskan isi video 18 fade in fade out efek muncul atau hilangnya video audio secara perlahan 19 speed kecepatan mengatur kecepatan video digunakan untuk slow motion atau time lapse 20 crop pangkas tampilan menghapus sebagian area video untuk fokus pada bagian tertentu 21 aspect ratio rasio aspek perbandingan lebar dan tinggi video misal: 16:9 9:16 1:1 22 resolution resolusi jumlah piksel dalam video semakin tinggi resolusi semakin tajam hasilnya 23 export render ekspor proses akhir menghasilkan file video jadi dari proyek yang telah diedit 24 preview pratinjau menampilkan hasil sementara sebelum ekspor 25 template templat desain atau susunan video siap pakai yang bisa diisi dengan konten sendiri 26 mask menyembunyikan atau menampilkan sebagian klip menggunakan bentuk tertentu lingkaran persegi gradasi 27 background remover chroma key menghapus latar belakang biasanya hijau dan menggantinya dengan gambar lain 28 stabilization penstabilan mengurangi goyangan kamera agar video tampak lebih halus 29 auto captions teks otomatis fitur yang otomatis menulis teks berdasarkan ucapan dalam video 30 draft draf proyek sementara yang belum diekspor dan masih dapat diedit kembali",
      "headings": [
        "Instalasi dan Antarmuka CapCut",
        "Membuat Proyek Baru di CapCut",
        "Proses Editing di CapCut",
        "Glosarium"
      ],
      "keywords": [
        "Instalasi dan Antarmuka CapCut",
        "Membuat Proyek Baru di CapCut",
        "Proses Editing di CapCut",
        "Glosarium",
        "editor video gratis",
        "Timeline",
        "Clip (Klip)",
        "Project (Proyek)",
        "Trim (Memangkas)",
        "Split (Membagi)",
        "Cut / Delete (Potong / Hapus)",
        "Layer (Lapisan)",
        "Transition (Transisi)",
        "Filter",
        "Effect (Efek)",
        "Text / Subtitle (Teks / Subtitel)",
        "Sticker / Element (Stiker / Elemen)",
        "Animation (Animasi)",
        "Overlay (Tumpukan)",
        "Keyframe",
        "Audio Track (Trek Audio)",
        "Voice Over (Narasi Suara)",
        "Fade In / Fade Out",
        "Speed (Kecepatan)",
        "Crop (Pangkas Tampilan)",
        "Aspect Ratio (Rasio Aspek)",
        "Resolution (Resolusi)",
        "Export / Render (Ekspor / Proses Akhir)",
        "Preview (Pratinjau)",
        "Template (Templat)",
        "Mask",
        "Background Remover / Chroma Key",
        "Stabilization (Penstabilan)",
        "Auto Captions (Teks Otomatis)",
        "Draft (Draf)"
      ]
    }
  },
  {
    "slug": "/bab-3/tahap-pra-produksi",
    "title": "Tahap Pra-Produksi",
    "description": "",
    "content": "Tahap pra-produksi adalah fase perencanaan dan merupakan tahap paling krusial yang menentukan keberhasilan sebuah video. Perencanaan yang matang tidak hanya memastikan pesan pembelajaran tersampaikan secara efektif, tetapi juga menghemat waktu dan sumber daya selama proses produksi dan pasca-produksi\n\nLangkah-langkah kunci dalam tahap ini meliputi:\n\n## Menemukan Ide & Menentukan Tujuan Pembelajaran (Learning Objective):\n\nProses dimulai dengan menjawab pertanyaan fundamental\\*\\*: \"Setelah menonton video ini, apa satu hal spesifik yang harus dilakukan atau dipahami oleh siswa?\" Tujuan yang jelas dan terukur adalah kompas yang akan memandu semua keputusan kreatif selanjutnya. Ide dapat digali dari materi ajar, pertanyaan yang sering diajukan siswa, atau miskonsepsi umum yang perlu diluruskan.\n\n## Mengenali Target Audiens\n\nSiapa penonton utama video ini? Apakah siswa kelas VII atau kelas IX? Apa tingkat pengetahuan awal mereka? Memahami audiens akan menentukan gaya bahasa yang digunakan, kedalaman materi yang disajikan, dan contoh yang relevan.\n\n## Menulis Naskah/Skrip Sederhana\n\nNaskah adalah cetak biru dari video Anda. Untuk video pendek, naskah tidak perlu rumit. Cukup tuliskan poin-poin utama dalam tiga bagian:\n\n* Hook (Kail): 3-5 detik pertama yang dirancang untuk menarik perhatian (misalnya, pertanyaan mengejutkan, fakta menarik).\n* Isi (Body): Penjelasan inti dari tujuan pembelajaran, disampaikan secara ringkas dan jelas.\n* Call-to-Action (CTA): Ajakan di akhir video (misalnya, \"Tulis jawabanmu di komentar!\", \"Lanjut ke video bagian 2!\")..\n\n## Membuat *Storyboard* Sederhana\n\n*Storyboard* adalah visualisasi naskah dalam bentuk sketsa kasar. Ini membantu merencanakan komposisi visual setiap adegan, sudut pengambilan gambar, teks yang akan muncul di layar, dan alur cerita secara keseluruhan. *Storyboard* tidak harus indah; fungsinya adalah sebagai panduan visual bagi sutradara (yaitu, Anda sendiri) saat proses perekaman\n\nPerencanaan yang solid di tahap pra-produksi secara langsung menyebabkan proses produksi dan pasca-produksi menjadi lebih cepat, lebih mudah, dan lebih efisien. Naskah yang jelas mengurangi keraguan saat merekam, dan storyboard yang baik berfungsi sebagai peta jalan saat proses penyuntingan\n",
    "_searchMeta": {
      "cleanContent": "tahap pra-produksi adalah fase perencanaan dan merupakan tahap paling krusial yang menentukan keberhasilan sebuah video perencanaan yang matang tidak hanya memastikan pesan pembelajaran tersampaikan secara efektif tetapi juga menghemat waktu dan sumber daya selama proses produksi dan pasca-produksi langkah-langkah kunci dalam tahap ini meliputi: menemukan ide menentukan tujuan pembelajaran learning objective : proses dimulai dengan menjawab pertanyaan fundamental : setelah menonton video ini apa satu hal spesifik yang harus dilakukan atau dipahami oleh siswa tujuan yang jelas dan terukur adalah kompas yang akan memandu semua keputusan kreatif selanjutnya ide dapat digali dari materi ajar pertanyaan yang sering diajukan siswa atau miskonsepsi umum yang perlu diluruskan mengenali target audiens siapa penonton utama video ini apakah siswa kelas vii atau kelas ix apa tingkat pengetahuan awal mereka memahami audiens akan menentukan gaya bahasa yang digunakan kedalaman materi yang disajikan dan contoh yang relevan menulis naskah skrip sederhana naskah adalah cetak biru dari video anda untuk video pendek naskah tidak perlu rumit cukup tuliskan poin-poin utama dalam tiga bagian: hook kail : 3-5 detik pertama yang dirancang untuk menarik perhatian misalnya pertanyaan mengejutkan fakta menarik isi body : penjelasan inti dari tujuan pembelajaran disampaikan secara ringkas dan jelas call-to-action cta : ajakan di akhir video misalnya tulis jawabanmu di komentar lanjut ke video bagian 2 membuat storyboard sederhana storyboard adalah visualisasi naskah dalam bentuk sketsa kasar ini membantu merencanakan komposisi visual setiap adegan sudut pengambilan gambar teks yang akan muncul di layar dan alur cerita secara keseluruhan storyboard tidak harus indah fungsinya adalah sebagai panduan visual bagi sutradara yaitu anda sendiri saat proses perekaman perencanaan yang solid di tahap pra-produksi secara langsung menyebabkan proses produksi dan pasca-produksi menjadi lebih cepat lebih mudah dan lebih efisien naskah yang jelas mengurangi keraguan saat merekam dan storyboard yang baik berfungsi sebagai peta jalan saat proses penyuntingan",
      "headings": [
        "Menemukan Ide & Menentukan Tujuan Pembelajaran (Learning Objective):",
        "Mengenali Target Audiens",
        "Menulis Naskah/Skrip Sederhana",
        "Membuat *Storyboard* Sederhana"
      ],
      "keywords": [
        "Menemukan Ide & Menentukan Tujuan Pembelajaran (Learning Objective):",
        "Mengenali Target Audiens",
        "Menulis Naskah/Skrip Sederhana",
        "Membuat *Storyboard* Sederhana"
      ]
    }
  },
  {
    "slug": "/bab-3/tahap-produksi",
    "title": "Tahap Pra-Produksi",
    "description": "",
    "content": "Dengan smartphone modern, siapa pun dapat merekam video berkualitas tinggi. Kuncinya bukan pada harga perangkat, melainkan pada pemahaman teknik dasar produksi.\n\n## Mengoptimalkan Smartphone untuk Perekaman\n\n* Pencahayaan (Lighting): Cahaya adalah elemen terpenting dalam video. Sumber cahaya terbaik dan gratis adalah cahaya alami. Posisikan diri Anda menghadap jendela atau sumber cahaya, jangan membelakanginya (backlight) karena akan membuat subjek menjadi gelap.61\n* Audio yang Jernih: Kualitas audio seringkali lebih penting daripada kualitas video. Rekam di ruangan yang tenang dan bebas gema. Gunakan mikrofon bawaan dari earphone Anda untuk hasil yang jauh lebih baik daripada mikrofon internal ponsel.61\n* Stabilitas Gambar: Gambar yang goyang sangat mengganggu penonton. Gunakan tripod ponsel yang terjangkau atau sandarkan ponsel Anda pada tumpukan buku atau objek stabil lainnya untuk memastikan gambar tetap tenang.\n* Komposisi Dasar: Hindari menempatkan subjek tepat di tengah layar. Aktifkan fitur \"grid\" atau \"kisi\" pada kamera Anda dan terapkan Rule of Thirds dengan menempatkan mata atau subjek utama di salah satu titik persimpangan garis untuk komposisi yang lebih profesional dan menarik secara visual\n\n## Variasi Teknik Pengambilan Gambar\n\n* Wide Shot (WS): Menampilkan subjek secara keseluruhan beserta latar belakangnya. Cocok untuk memperkenalkan lokasi atau konteks.\n* Medium Shot (MS): Menampilkan subjek dari pinggang ke atas. Ideal untuk percakapan atau interaksi antar karakter.\n* Close-Up (CU): Fokus pada wajah atau objek tertentu untuk menonjolkan emosi atau detail penting.\n* Over-the-Shoulder (OTS): Menampilkan perspektif dari belakang bahu seseorang, sering digunakan dalam dialog untuk menunjukkan interaksi antar karakter.\n* Point of View (POV): Menampilkan apa yang dilihat oleh subjek, memberikan penonton pengalaman langsung dari sudut pandang karakter.\n* High Angle & Low Angle: Pengambilan gambar dari sudut tinggi dapat membuat subjek terlihat lebih kecil atau rentan, sedangkan sudut rendah dapat memberikan kesan kekuatan atau dominasi pada subjek.\n\nUntuk membuat video lebih dinamis, rekam materi Anda dari beberapa sudut dan jarak yang berbeda. Kombinasikan Wide Shot (menampilkan seluruh lingkungan), Medium Shot (menampilkan dari pinggang ke atas), dan Close-Up (menampilkan\r\ndetail penting) untuk menjaga perhatian penonton\n",
    "_searchMeta": {
      "cleanContent": "dengan smartphone modern siapa pun dapat merekam video berkualitas tinggi kuncinya bukan pada harga perangkat melainkan pada pemahaman teknik dasar produksi mengoptimalkan smartphone untuk perekaman pencahayaan lighting : cahaya adalah elemen terpenting dalam video sumber cahaya terbaik dan gratis adalah cahaya alami posisikan diri anda menghadap jendela atau sumber cahaya jangan membelakanginya backlight karena akan membuat subjek menjadi gelap 61 audio yang jernih: kualitas audio seringkali lebih penting daripada kualitas video rekam di ruangan yang tenang dan bebas gema gunakan mikrofon bawaan dari earphone anda untuk hasil yang jauh lebih baik daripada mikrofon internal ponsel 61 stabilitas gambar: gambar yang goyang sangat mengganggu penonton gunakan tripod ponsel yang terjangkau atau sandarkan ponsel anda pada tumpukan buku atau objek stabil lainnya untuk memastikan gambar tetap tenang komposisi dasar: hindari menempatkan subjek tepat di tengah layar aktifkan fitur grid atau kisi pada kamera anda dan terapkan rule of thirds dengan menempatkan mata atau subjek utama di salah satu titik persimpangan garis untuk komposisi yang lebih profesional dan menarik secara visual variasi teknik pengambilan gambar wide shot ws : menampilkan subjek secara keseluruhan beserta latar belakangnya cocok untuk memperkenalkan lokasi atau konteks medium shot ms : menampilkan subjek dari pinggang ke atas ideal untuk percakapan atau interaksi antar karakter close-up cu : fokus pada wajah atau objek tertentu untuk menonjolkan emosi atau detail penting over-the-shoulder ots : menampilkan perspektif dari belakang bahu seseorang sering digunakan dalam dialog untuk menunjukkan interaksi antar karakter point of view pov : menampilkan apa yang dilihat oleh subjek memberikan penonton pengalaman langsung dari sudut pandang karakter high angle low angle: pengambilan gambar dari sudut tinggi dapat membuat subjek terlihat lebih kecil atau rentan sedangkan sudut rendah dapat memberikan kesan kekuatan atau dominasi pada subjek untuk membuat video lebih dinamis rekam materi anda dari beberapa sudut dan jarak yang berbeda kombinasikan wide shot menampilkan seluruh lingkungan medium shot menampilkan dari pinggang ke atas dan close-up menampilkan detail penting untuk menjaga perhatian penonton",
      "headings": [
        "Mengoptimalkan Smartphone untuk Perekaman",
        "Variasi Teknik Pengambilan Gambar"
      ],
      "keywords": [
        "Mengoptimalkan Smartphone untuk Perekaman",
        "Variasi Teknik Pengambilan Gambar"
      ]
    }
  },
  {
    "slug": "/basic-setup/changelog",
    "title": "Changelog",
    "description": "Changelogs and improvements to the Documents projects.",
    "content": "## Added\n\n**Linting and Formatting**:\n\n* Added `pnpm run lint` and `pnpm run lint:fix` scripts to automate linting tasks.\n* Added `pnpm run format` and `pnpm run format:check` scripts to ensure consistent code formatting.\n\n**SEO Enhancements**:\n\n* Added an SEO component to MDX pages to dynamically include `keywords` and `lastModified` metadata for improved SEO generation.\n\n## Updated\n\n**Next.js Upgrade**:\n\n* Upgraded the project from **Next.js 14** to **Next.js 15**, leveraging the latest features and performance improvements.\n\n**Codebase Improvements**:\n\n* Reordered imports across the project files for better consistency and readability.\n\n**Mermaid Component**:\n\n* Fixed an ID bug that caused rendering issues when multiple Mermaid diagrams were included in MDX pages.\n* Improved initialization and rendering logic to prevent duplicate diagram rendering.\n",
    "_searchMeta": {
      "cleanContent": "added linting and formatting: added pnpm run lint and pnpm run lint:fix scripts to automate linting tasks added pnpm run format and pnpm run format:check scripts to ensure consistent code formatting seo enhancements: added an seo component to mdx pages to dynamically include keywords and lastmodified metadata for improved seo generation updated next js upgrade: upgraded the project from next js 14 to next js 15 leveraging the latest features and performance improvements codebase improvements: reordered imports across the project files for better consistency and readability mermaid component: fixed an id bug that caused rendering issues when multiple mermaid diagrams were included in mdx pages improved initialization and rendering logic to prevent duplicate diagram rendering",
      "headings": [
        "Added",
        "Updated"
      ],
      "keywords": [
        "changelog",
        "guide",
        "nextjs",
        "documents",
        "Added",
        "Updated",
        "Linting and Formatting",
        "SEO Enhancements",
        "Next.js Upgrade",
        "Next.js 14",
        "Next.js 15",
        "Codebase Improvements",
        "Mermaid Component",
        "pnpm run lint",
        "pnpm run lint:fix",
        "pnpm run format",
        "pnpm run format:check",
        "keywords",
        "lastModified"
      ]
    }
  },
  {
    "slug": "/basic-setup",
    "title": "Introduction",
    "description": "This section provides an overview of how to get started with the Documents, Next.js Document Starter Kit.",
    "content": "![Banner](/images/banner.png \"Documents\")\n\n## Documents\n\n**Documents** is a lightweight, modular starter kit built with **Next.js**, **React**, **Tailwind CSS**, and **TypeScript**. It’s designed to help you\r\nlaunch structured, professional documentation without spending time on boilerplate.\n\nWhether you're building product manuals, internal systems guides, or dev documentation, Documents gives you a clean foundation that’s easy to\r\nextend and maintain.\n\n## Why use Documents?\n\nThis kit was built to simplify how teams manage and publish documentation. It works across projects of all sizes—from a single\r\nreadme to enterprise knowledge bases.\n\nWith MDX, reusable components, and Tailwind styling, it keeps your workflow efficient without compromising flexibility.\n\nUse it for:\n\n* **Product Guides** – Setup, usage, and troubleshooting\n* **Internal Docs** – Processes, policies, and team references\n* **Technical Manuals** – APIs, SDKs, architecture walkthroughs\n\nCustomize the UI and structure to match your brand or workflow—no lock-in.\n\n## Core Features\n\n| Feature                              | Description                                                                 |\r\n| ------------------------------------ | --------------------------------------------------------------------------- |\r\n| **Write in Markdown/MDX**            | Combine Markdown with components and Mermaid.js for rich content.           |\r\n| **Flexible Navigation**              | Multi-level menus, page hierarchy, and auto-generated TOCs.                 |\r\n| **Code Support**                     | Syntax highlighting, code tabs, and one-click copy.                         |\r\n| **Search**                           | Fuzzy matching with highlight and instant results.                          |\r\n| **Responsive Design**                | Built-in light/dark mode with mobile support.                               |\r\n| **Math + Tables**                    | LaTeX rendering and clean table styling.                                    |\r\n| **SEO Defaults**                     | Preconfigured meta, Open Graph, and structured data.                        |\r\n| **AI Docs (Upcoming)**               | AI tools for smart search and content generation (coming soon).             |\n\n## Using This Kit\n\nNavigation is on the left. Pages flow from setup to advanced features, but you're free to jump around.\n\nUse the table of contents on the right to skip through sections.\n\nStart with the [Installation Guide](/docs/basic-setup/installation).\n\n## Community Support\n\nGot questions? Reach out via:\n\n* [GitHub](https://github.com/rubixvi/rubix-documents)\n* [Twitter](https://x.com/rubixstory)\n* [Facebook](https://www.facebook.com/rubixstudios)\n",
    "_searchMeta": {
      "cleanContent": "banner documents documents is a lightweight modular starter kit built with next js react tailwind css and typescript it s designed to help you launch structured professional documentation without spending time on boilerplate whether you re building product manuals internal systems guides or dev documentation documents gives you a clean foundation that s easy to extend and maintain why use documents this kit was built to simplify how teams manage and publish documentation it works across projects of all sizes from a single readme to enterprise knowledge bases with mdx reusable components and tailwind styling it keeps your workflow efficient without compromising flexibility use it for: product guides setup usage and troubleshooting internal docs processes policies and team references technical manuals apis sdks architecture walkthroughs customize the ui and structure to match your brand or workflow no lock-in core features feature description ------------------------------------ --------------------------------------------------------------------------- write in markdown mdx combine markdown with components and mermaid js for rich content flexible navigation multi-level menus page hierarchy and auto-generated tocs code support syntax highlighting code tabs and one-click copy search fuzzy matching with highlight and instant results responsive design built-in light dark mode with mobile support math tables latex rendering and clean table styling seo defaults preconfigured meta open graph and structured data ai docs upcoming ai tools for smart search and content generation coming soon using this kit navigation is on the left pages flow from setup to advanced features but you re free to jump around use the table of contents on the right to skip through sections start with the installation guide community support got questions reach out via: github twitter facebook",
      "headings": [
        "Documents",
        "Why use Documents?",
        "Core Features",
        "Using This Kit",
        "Community Support"
      ],
      "keywords": [
        "introduction",
        "guide",
        "nextjs",
        "documents",
        "Documents",
        "Why use Documents?",
        "Core Features",
        "Using This Kit",
        "Community Support",
        "Next.js",
        "React",
        "Tailwind CSS",
        "TypeScript",
        "Product Guides",
        "Internal Docs",
        "Technical Manuals",
        "Write in Markdown/MDX",
        "Flexible Navigation",
        "Code Support",
        "Search",
        "Responsive Design",
        "Math + Tables",
        "SEO Defaults",
        "AI Docs (Upcoming)"
      ]
    }
  },
  {
    "slug": "/basic-setup/installation",
    "title": "Installation",
    "description": "This guide covers the installation of Documents and how to edit your new project.",
    "content": "To install and edit the Documents, you need to have several prerequisites in place. Here's a list of all the essential pre-requisites\r\nfor setting up and working on this project.\n\n[![Deploy with Vercel](https://vercel.com/button)](https://vercel.com/new/clone?repository-url=https%3A%2F%2Fgithub.com%2Frubixvi%2Frubix-documents\\&project-name=my-documents\\&repository-name=my-documents\\&demo-title=Documents\\&demo-description=This%20Document%20Starter%20Kit%20is%20developed%20with%20Next.js%2C%20Tailwind%20CSS%20and%20TypeScript.%20It%20serves%20as%20a%20flexible%20and%20scalable%20foundation%20for%20building%20documentation%20websites%20or%20content-driven%20projects.\\&demo-url=https%3A%2F%2Frubix-documents.vercel.app%2F\\&demo-image=https%3A%2F%2Fgithub.com%2Frubixvi%2Frubix-documents%2Fblob%2Fmain%2Fpublic%2Fscreens%2Fscreen-1.png)\n\n## Prerequisites\n\n## Installation\n\n## Optional\n\n## Important Information\n\nThe project's search functionality relies on the Husky's automation to build `search-data/documents.json` ensure git commit is performed to generate this file.\n",
    "_searchMeta": {
      "cleanContent": "to install and edit the documents you need to have several prerequisites in place here s a list of all the essential pre-requisites for setting up and working on this project deploy with vercel https: vercel com new clone repository-url https 3a 2f 2fgithub com 2frubixvi 2frubix-documents project-name my-documents repository-name my-documents demo-title documents demo-description this 20document 20starter 20kit 20is 20developed 20with 20next js 2c 20tailwind 20css 20and 20typescript 20it 20serves 20as 20a 20flexible 20and 20scalable 20foundation 20for 20building 20documentation 20websites 20or 20content-driven 20projects demo-url https 3a 2f 2frubix-documents vercel app 2f demo-image https 3a 2f 2fgithub com 2frubixvi 2frubix-documents 2fblob 2fmain 2fpublic 2fscreens 2fscreen-1 png prerequisites installation optional important information the project s search functionality relies on the husky s automation to build search-data documents json ensure git commit is performed to generate this file",
      "headings": [
        "Prerequisites",
        "Installation",
        "Optional",
        "Important Information"
      ],
      "keywords": [
        "installation",
        "github",
        "node",
        "guide",
        "nextjs",
        "documents",
        "Prerequisites",
        "Installation",
        "Optional",
        "Important Information",
        "search-data/documents.json"
      ]
    }
  },
  {
    "slug": "/basic-setup/setup",
    "title": "Setup",
    "description": "Setting up and configuring your documentation project",
    "content": "Setting up your new documentation project is straightforward. Most of the essential project settings can be configured within the `settings` folder.\n\n## Settings\n\nThis section provides the core settings for your documentation site, such as defining the site's URL, site icon and title.\n\n```tsx showLineNumbers\nexport const url = \"\"                 // The URL for your documentation site\r\nexport const siteicon = \"\"            // Icon displayed next to the site name in the header\r\nexport const sitename = \"\"            // Title of your documentation site\n```\n\n## Google Tags\n\nThis section allows you to integrate Google Tag Manager into your documentation project. You can add your GTM code and configure whether it's connected.\n\n```tsx showLineNumbers\nexport const gtm = \"\"                 // Add your Google Tag Manager code here\r\nexport const gtmconnected = true      // Set to true if GTM is connected, otherwise set to false\n```\n\n## Search Engine\n\nConfigure essential SEO settings to ensure your documentation site is optimized for search engines. This includes meta descriptions, keywords and social media sharing details like images and alt text.\n\n```tsx showLineNumbers\nexport const description = \"\"         // Description of your documentation site for SEO\r\nexport const keywords = [\"\", \"\"]      // List of SEO keywords for your documentation site\r\nexport const urlimage = \"\"            // The URL of the image used when sharing on social media)\r\nexport const imagealt = \"\"            // Alt text for shared images, helpful for screen readers\r\nexport const twitterhandle = \"\"       // Your company’s Twitter handle for social sharing\n```\n\n## Footer Branding\n\nThe footer settings allow you to customize the company information displayed at the bottom of the site. You can add the company name and the URL that the name will link to.\n\n```tsx showLineNumbers\nexport const companyname = \"\"         // The company name displayed in the copyright section\r\nexport const companylink = \"\"         // The URL your company name should link to\n```\n\n## General Layout\n\nThe layout settings control the appearance and functionality of various elements of the documentation site, such as branding, the right sidebar, feedback options, table of contents, and scroll-to-top functionality.\n\n```tsx showLineNumbers\nexport const branding = true          // Set to true to display our branding elements\r\nexport const rightsidebar = true      // Set to true to enable the right sidebar with feedback, table of contents and scroll-to-top\r\nexport const feedbackedit = true      // Control to enable/disable feedback on GitHub\r\nexport const tableofcontent = true    // Control to enable/disable the generated table of contents\r\nexport const totopscroll = true       // Control to enable/disable scroll-to-top button\n```\n\n## Github Control\n\nIf your MDX files are hosted on GitHub, you can configure the project to load documents directly from there. This option can be useful for syncing documentation updates directly with your repository.\n\n```tsx showLineNumbers\nexport const loadfromgithub = false   // Set to true to load your MDX documents directly from GitHub\n```\n\n## Project Structure\n",
    "_searchMeta": {
      "cleanContent": "setting up your new documentation project is straightforward most of the essential project settings can be configured within the settings folder settings this section provides the core settings for your documentation site such as defining the site s url site icon and title google tags this section allows you to integrate google tag manager into your documentation project you can add your gtm code and configure whether it s connected search engine configure essential seo settings to ensure your documentation site is optimized for search engines this includes meta descriptions keywords and social media sharing details like images and alt text footer branding the footer settings allow you to customize the company information displayed at the bottom of the site you can add the company name and the url that the name will link to general layout the layout settings control the appearance and functionality of various elements of the documentation site such as branding the right sidebar feedback options table of contents and scroll-to-top functionality github control if your mdx files are hosted on github you can configure the project to load documents directly from there this option can be useful for syncing documentation updates directly with your repository project structure",
      "headings": [
        "Settings",
        "Google Tags",
        "Search Engine",
        "Footer Branding",
        "General Layout",
        "Github Control",
        "Project Structure"
      ],
      "keywords": [
        "setup",
        "configuration",
        "layout",
        "Google",
        "SEO",
        "nextjs",
        "documents",
        "Settings",
        "Google Tags",
        "Search Engine",
        "Footer Branding",
        "General Layout",
        "Github Control",
        "Project Structure",
        "settings",
        "tsx showLineNumbers\nexport const url = \"\"                 // The URL for your documentation site\r\nexport const siteicon = \"\"            // Icon displayed next to the site name in the header\r\nexport const sitename = \"\"            // Title of your documentation site",
        "## Google Tags\n\nThis section allows you to integrate Google Tag Manager into your documentation project. You can add your GTM code and configure whether it's connected.",
        "tsx showLineNumbers\nexport const gtm = \"\"                 // Add your Google Tag Manager code here\r\nexport const gtmconnected = true      // Set to true if GTM is connected, otherwise set to false",
        "## Search Engine\n\nConfigure essential SEO settings to ensure your documentation site is optimized for search engines. This includes meta descriptions, keywords and social media sharing details like images and alt text.",
        "tsx showLineNumbers\nexport const description = \"\"         // Description of your documentation site for SEO\r\nexport const keywords = [\"\", \"\"]      // List of SEO keywords for your documentation site\r\nexport const urlimage = \"\"            // The URL of the image used when sharing on social media)\r\nexport const imagealt = \"\"            // Alt text for shared images, helpful for screen readers\r\nexport const twitterhandle = \"\"       // Your company’s Twitter handle for social sharing",
        "## Footer Branding\n\nThe footer settings allow you to customize the company information displayed at the bottom of the site. You can add the company name and the URL that the name will link to.",
        "tsx showLineNumbers\nexport const companyname = \"\"         // The company name displayed in the copyright section\r\nexport const companylink = \"\"         // The URL your company name should link to",
        "## General Layout\n\nThe layout settings control the appearance and functionality of various elements of the documentation site, such as branding, the right sidebar, feedback options, table of contents, and scroll-to-top functionality.",
        "tsx showLineNumbers\nexport const branding = true          // Set to true to display our branding elements\r\nexport const rightsidebar = true      // Set to true to enable the right sidebar with feedback, table of contents and scroll-to-top\r\nexport const feedbackedit = true      // Control to enable/disable feedback on GitHub\r\nexport const tableofcontent = true    // Control to enable/disable the generated table of contents\r\nexport const totopscroll = true       // Control to enable/disable scroll-to-top button",
        "## Github Control\n\nIf your MDX files are hosted on GitHub, you can configure the project to load documents directly from there. This option can be useful for syncing documentation updates directly with your repository.",
        "tsx showLineNumbers\nexport const loadfromgithub = false   // Set to true to load your MDX documents directly from GitHub"
      ]
    }
  },
  {
    "slug": "/markdown/cards",
    "title": "Cards",
    "description": "Explore and implement various card styles, including small, large and image cards.",
    "content": "This section introduces the different card styles available in the system, from compact small cards to visually rich image cards. Each example is paired with JSX code snippets, providing you with a practical guide to incorporate these components seamlessly into your project.\n\n## Small Card\n\n```jsx\n<CardGrid>\r\n  <Card\r\n    title=\"Instructions\"\r\n    href=\"/docs/basic-setup/installation\"\r\n    icon=\"alignJustify\"\r\n    variant=\"small\"\r\n    description=\"test description\"\r\n  />\r\n  <Card\r\n    title=\"Setup\"\r\n    href=\"/docs/basic-setup/setup\"\r\n    icon=\"alignJustify\"\r\n    variant=\"small\"\r\n  />\r\n  <Card\r\n    title=\"Rubix Studios\"\r\n    href=\"https://rubixstudios.com.au\"\r\n    icon=\"alignJustify\"\r\n    external={true}\r\n    variant=\"small\"\r\n  />\r\n</CardGrid>\n```\n\n## Large Card\n\n```jsx\n<CardGrid>\r\n  <Card\r\n    subtitle=\"Instructions\"\r\n    title=\"Installation\"\r\n    description=\"Get started with Documents using our quick start installation guide to get your project started.\"\r\n    href=\"/docs/basic-setup/installation\"\r\n  />\r\n  <Card\r\n    subtitle=\"Setup\"\r\n    title=\"Site Settings\"\r\n    description=\"Setting up your Documents projects layout, links and search engine optimisation.\"\r\n    href=\"/docs/basic-setup/setup\"\r\n  />\r\n  <Card\r\n    subtitle=\"Support\"\r\n    title=\"Rubix Studios\"\r\n    description=\"Australia's leading branding, marketing and web development company.\"\r\n    href=\"https://rubixstudios.com.au\"\r\n    external={true}\r\n  />\r\n</CardGrid>\n```\n\n## Image Card\n\n```jsx\n<CardGrid>\r\n  <Card\r\n    title=\"Instructions\"\r\n    href=\"/docs/introduction/installation\"\r\n    image=\"/images/og-image.png\"\r\n    variant=\"image\"\r\n  />\r\n  <Card\r\n    title=\"Setup\"\r\n    href=\"/docs/introduction/setup\"\r\n    image=\"/images/og-image.png\"\r\n    variant=\"image\"\r\n  />\r\n  <Card\r\n    title=\"Rubix Studios\"\r\n    href=\"https://www.rubixstudios.com.au\"\r\n    image=\"/images/og-image.png\"\r\n    external={true}\r\n    variant=\"image\"\r\n  />\r\n</CardGrid>\n```\n",
    "_searchMeta": {
      "cleanContent": "this section introduces the different card styles available in the system from compact small cards to visually rich image cards each example is paired with jsx code snippets providing you with a practical guide to incorporate these components seamlessly into your project small card large card image card",
      "headings": [
        "Small Card",
        "Large Card",
        "Image Card"
      ],
      "keywords": [
        "Small Card",
        "Large Card",
        "Image Card",
        "jsx\n<CardGrid>\r\n  <Card\r\n    title=\"Instructions\"\r\n    href=\"/docs/basic-setup/installation\"\r\n    icon=\"alignJustify\"\r\n    variant=\"small\"\r\n    description=\"test description\"\r\n  />\r\n  <Card\r\n    title=\"Setup\"\r\n    href=\"/docs/basic-setup/setup\"\r\n    icon=\"alignJustify\"\r\n    variant=\"small\"\r\n  />\r\n  <Card\r\n    title=\"Rubix Studios\"\r\n    href=\"https://rubixstudios.com.au\"\r\n    icon=\"alignJustify\"\r\n    external={true}\r\n    variant=\"small\"\r\n  />\r\n</CardGrid>",
        "## Large Card",
        "jsx\n<CardGrid>\r\n  <Card\r\n    subtitle=\"Instructions\"\r\n    title=\"Installation\"\r\n    description=\"Get started with Documents using our quick start installation guide to get your project started.\"\r\n    href=\"/docs/basic-setup/installation\"\r\n  />\r\n  <Card\r\n    subtitle=\"Setup\"\r\n    title=\"Site Settings\"\r\n    description=\"Setting up your Documents projects layout, links and search engine optimisation.\"\r\n    href=\"/docs/basic-setup/setup\"\r\n  />\r\n  <Card\r\n    subtitle=\"Support\"\r\n    title=\"Rubix Studios\"\r\n    description=\"Australia's leading branding, marketing and web development company.\"\r\n    href=\"https://rubixstudios.com.au\"\r\n    external={true}\r\n  />\r\n</CardGrid>",
        "## Image Card",
        "jsx\n<CardGrid>\r\n  <Card\r\n    title=\"Instructions\"\r\n    href=\"/docs/introduction/installation\"\r\n    image=\"/images/og-image.png\"\r\n    variant=\"image\"\r\n  />\r\n  <Card\r\n    title=\"Setup\"\r\n    href=\"/docs/introduction/setup\"\r\n    image=\"/images/og-image.png\"\r\n    variant=\"image\"\r\n  />\r\n  <Card\r\n    title=\"Rubix Studios\"\r\n    href=\"https://www.rubixstudios.com.au\"\r\n    image=\"/images/og-image.png\"\r\n    external={true}\r\n    variant=\"image\"\r\n  />\r\n</CardGrid>"
      ]
    }
  },
  {
    "slug": "/markdown/diagrams",
    "title": "Diagrams",
    "description": "Add various diagram types, including flowcharts, decision trees and entity-relationship diagrams.",
    "content": "Diagrams are powerful tools for visualizing processes, relationships, and decisions. This section showcases different types of diagrams created using **Mermaid**, complete with examples and reusable code snippets to integrate into your projects.\n\n## Flowchart\n\nA flowchart represents a sequence of steps or processes in a visual format. Use this diagram to map workflows, decision-making processes, or operational flows.\n\n```jsx\n<Mermaid\r\n  chart={\\`\r\n    graph TD;\r\n    Start --> Task1;\r\n    Task1 --> Task2;\r\n    Task2 --> End;\r\n  \\`}\r\n/>\n```\n\n## Decision Tree\n\nDecision trees illustrate choices and possible outcomes, making them ideal for decision-making workflows or processes involving multiple paths.\n\n```jsx\n<Mermaid\r\n  chart={\\`\r\n    graph TD;\r\n    A[Start] --> B{Is it raining?};\r\n    B -->|Yes| C[Take an umbrella];\r\n    B -->|No| D[Enjoy the weather];\r\n    C --> E[Go outside];\r\n    D --> E;\r\n  \\`}\r\n/>\n```\n\n## Entity-Relationship Diagram\n\nEntity-relationship diagrams (ERDs) are used to model relationships between entities in a system. They are widely used in database design and system architecture planning.\n\n```jsx\n<Mermaid\r\n  chart={\\`\r\n    erDiagram\r\n    CUSTOMER ||--o{ ORDER : places\r\n    ORDER ||--|{ LINE-ITEM : contains\r\n    PRODUCT ||--o{ LINE-ITEM : \"included in\"\r\n    CUSTOMER {\r\n        string name\r\n        string email\r\n    }\r\n    ORDER {\r\n        int orderNumber\r\n        date orderDate\r\n    }\r\n    LINE-ITEM {\r\n        int quantity\r\n        float price\r\n    }\r\n    PRODUCT {\r\n        int productId\r\n        string name\r\n        float price\r\n    }\r\n  \\`}\r\n/>\n```\n\nEach of these diagrams serves a specific purpose and Mermaid makes it easy to generate them dynamically. Feel free to experiment with the provided code snippets and adapt them to your needs.\n",
    "_searchMeta": {
      "cleanContent": "diagrams are powerful tools for visualizing processes relationships and decisions this section showcases different types of diagrams created using mermaid complete with examples and reusable code snippets to integrate into your projects flowchart a flowchart represents a sequence of steps or processes in a visual format use this diagram to map workflows decision-making processes or operational flows decision tree decision trees illustrate choices and possible outcomes making them ideal for decision-making workflows or processes involving multiple paths entity-relationship diagram entity-relationship diagrams erds are used to model relationships between entities in a system they are widely used in database design and system architecture planning each of these diagrams serves a specific purpose and mermaid makes it easy to generate them dynamically feel free to experiment with the provided code snippets and adapt them to your needs",
      "headings": [
        "Flowchart",
        "Decision Tree",
        "Entity-Relationship Diagram"
      ],
      "keywords": [
        "Flowchart",
        "Decision Tree",
        "Entity-Relationship Diagram",
        "Mermaid",
        "jsx\n<Mermaid\r\n  chart={\\",
        "}\r\n/>",
        "## Decision Tree\n\nDecision trees illustrate choices and possible outcomes, making them ideal for decision-making workflows or processes involving multiple paths.",
        "## Entity-Relationship Diagram\n\nEntity-relationship diagrams (ERDs) are used to model relationships between entities in a system. They are widely used in database design and system architecture planning."
      ]
    }
  },
  {
    "slug": "/markdown/filetree",
    "title": "Filetree",
    "description": "This section provides an overview of file structures and their implementation using the FileTree component.",
    "content": "This section demonstrates the structure of a file tree using the `FileTree` component. Below is an example showcasing folders and files organized hierarchically for a project setup.\n\n## How to Use\n\nIntegrate the `FileTree` component into your project to visually represent file and folder structures. This is particularly useful for documentation, tutorials, or providing users with an overview of your project's architecture.\n\n### JSX Code Example\n\nHere is how you can define the file tree structure in for use in your project:\n\n```jsx\n<FileTree>\r\n  <Folder name=\"src\" label=\"Source Code\">\r\n    <File name=\"index.tsx\" label=\"Index File\" />\r\n    <Folder name=\"components\" label=\"Components\">\r\n      <File name=\"button.tsx\" label=\"Button Component\" />\r\n      <File name=\"input.tsx\" label=\"Input Component\" />\r\n    </Folder>\r\n    <Folder name=\"pages\" label=\"Pages\">\r\n      <File name=\"home.tsx\" label=\"Home Page\" />\r\n      <File name=\"about.tsx\" label=\"About Page\" />\r\n    </Folder>\r\n  </Folder>\r\n</FileTree>\n```\n\nUse this code as a template to set up your own file tree structure and customize it as needed.\n",
    "_searchMeta": {
      "cleanContent": "this section demonstrates the structure of a file tree using the filetree component below is an example showcasing folders and files organized hierarchically for a project setup how to use integrate the filetree component into your project to visually represent file and folder structures this is particularly useful for documentation tutorials or providing users with an overview of your project s architecture jsx code example here is how you can define the file tree structure in for use in your project: use this code as a template to set up your own file tree structure and customize it as needed",
      "headings": [
        "How to Use"
      ],
      "keywords": [
        "How to Use",
        "FileTree",
        "jsx\n<FileTree>\r\n  <Folder name=\"src\" label=\"Source Code\">\r\n    <File name=\"index.tsx\" label=\"Index File\" />\r\n    <Folder name=\"components\" label=\"Components\">\r\n      <File name=\"button.tsx\" label=\"Button Component\" />\r\n      <File name=\"input.tsx\" label=\"Input Component\" />\r\n    </Folder>\r\n    <Folder name=\"pages\" label=\"Pages\">\r\n      <File name=\"home.tsx\" label=\"Home Page\" />\r\n      <File name=\"about.tsx\" label=\"About Page\" />\r\n    </Folder>\r\n  </Folder>\r\n</FileTree>"
      ]
    }
  },
  {
    "slug": "/markdown",
    "title": "Introduction",
    "description": "This section provides an overview of Introduction.",
    "content": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime, molestiae, facilis aperiam et, error illum vel ullam? Quis architecto dolore ullam\n\n* \\[x] Write the press release\n* \\[ ] Update the website\n* \\[ ] Contact the media\n\n| Syntax        | Description |   Test Text |\r\n| :------------ | :---------: | ----------: |\r\n| Header        |    Title    | Here's this |\r\n| Paragraph     |    Text     |    And more |\r\n| Strikethrough |             |    ~~Text~~ |\n\n## Sample Document with Mermaid\n\nHere is a Mermaid diagram:\n\nThis diagram should render automatically without any extra imports.\n\n## Getting Started\n\nTo begin using the Documentation Template, follow these simple steps:\n\n* Start by cloning the repository to your local machine.\n\nLorem ipsum dolor sit amet consectetur adipisicing elit. Reprehenderit quae iure nulla deserunt dolore quam pariatur minus sapiente accusantium. Optio, necessitatibus sequi. Veritatis, aspernatur? Possimus quis repellat eum vitae eveniet.\n\n## Blockquotes\n\nBlockquotes are useful for emphasizing key points or quoting external sources:\n\n> \"Documentation is a love letter that you write to your future self.\" - Damian Conway\n\nFeel free to use blockquotes to highlight important information or quotes relevant to your documentation.\n\n## Code Examples with switch\n\nHere a custom tab component from shadcn ui is used.\n\n## Conclusion\n\nThank you for choosing the Documentation Template for your project. Whether you're documenting software, APIs, or processes, we're here to support you in creating clear and effective documentation. Happy documenting!\n",
    "_searchMeta": {
      "cleanContent": "lorem ipsum dolor sit amet consectetur adipisicing elit numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime molestiae facilis aperiam et error illum vel ullam quis architecto dolore ullam x write the press release update the website contact the media syntax description test text :------------ :---------: ----------: header title here s this paragraph text and more strikethrough text sample document with mermaid here is a mermaid diagram: this diagram should render automatically without any extra imports getting started to begin using the documentation template follow these simple steps: start by cloning the repository to your local machine lorem ipsum dolor sit amet consectetur adipisicing elit reprehenderit quae iure nulla deserunt dolore quam pariatur minus sapiente accusantium optio necessitatibus sequi veritatis aspernatur possimus quis repellat eum vitae eveniet blockquotes blockquotes are useful for emphasizing key points or quoting external sources: documentation is a love letter that you write to your future self - damian conway feel free to use blockquotes to highlight important information or quotes relevant to your documentation code examples with switch here a custom tab component from shadcn ui is used conclusion thank you for choosing the documentation template for your project whether you re documenting software apis or processes we re here to support you in creating clear and effective documentation happy documenting",
      "headings": [
        "Sample Document with Mermaid",
        "Getting Started",
        "Blockquotes",
        "Code Examples with switch",
        "Conclusion"
      ],
      "keywords": [
        "Sample Document with Mermaid",
        "Getting Started",
        "Blockquotes",
        "Code Examples with switch",
        "Conclusion"
      ]
    }
  },
  {
    "slug": "/markdown/lists",
    "title": "Lists",
    "description": "This section provides an overview of creating and using lists in the Documents boilerplate.",
    "content": "Learn how to create and render different types of lists in the Documents boilerplate. Examples include checklists, ordered lists, unordered lists and nested lists.\n\n## Checklist\n\n* \\[x] Write the press release\n* \\[ ] Update the website\n* \\[ ] Contact the media\n\n```jsx\n- [x] Write the press release\r\n- [ ] Update the website\r\n- [ ] Contact the media\n```\n\n## Simple List\n\n* Item 1\n* Item 2\n* Item 3\n\n```jsx\n- Item 1\r\n- Item 2\r\n- Item 3\n```\n\n## Number List\n\n1. Research\n2. Draft the content\n3. Review and edit\n4. Publish\n\n```jsx\n1. Research\r\n2. Draft the content\r\n3. Review and edit\r\n4. Publish\n```\n\n## Nested List\n\n* Main Category 1\n  * Sub Item 1.1\n  * Sub Item 1.2\n* Main Category 2\n  * Sub Item 2.1\n  * Sub Item 2.2\n\n```jsx\n- Main Category 1\r\n  - Sub Item 1.1\r\n  - Sub Item 1.2\r\n- Main Category 2\r\n  - Sub Item 2.1\r\n  - Sub Item 2.2\n```\n\nUse these examples as a foundation to create and customize lists that fit your project's needs.\n",
    "_searchMeta": {
      "cleanContent": "learn how to create and render different types of lists in the documents boilerplate examples include checklists ordered lists unordered lists and nested lists checklist x write the press release update the website contact the media simple list item 1 item 2 item 3 number list research draft the content review and edit publish nested list main category 1 sub item 1 1 sub item 1 2 main category 2 sub item 2 1 sub item 2 2 use these examples as a foundation to create and customize lists that fit your project s needs",
      "headings": [
        "Checklist",
        "Simple List",
        "Number List",
        "Nested List"
      ],
      "keywords": [
        "Checklist",
        "Simple List",
        "Number List",
        "Nested List",
        "jsx\n- [x] Write the press release\r\n- [ ] Update the website\r\n- [ ] Contact the media",
        "## Simple List\n\n* Item 1\n* Item 2\n* Item 3",
        "jsx\n- Item 1\r\n- Item 2\r\n- Item 3",
        "## Number List\n\n1. Research\n2. Draft the content\n3. Review and edit\n4. Publish",
        "jsx\n1. Research\r\n2. Draft the content\r\n3. Review and edit\r\n4. Publish",
        "## Nested List\n\n* Main Category 1\n  * Sub Item 1.1\n  * Sub Item 1.2\n* Main Category 2\n  * Sub Item 2.1\n  * Sub Item 2.2",
        "jsx\n- Main Category 1\r\n  - Sub Item 1.1\r\n  - Sub Item 1.2\r\n- Main Category 2\r\n  - Sub Item 2.1\r\n  - Sub Item 2.2"
      ]
    }
  },
  {
    "slug": "/markdown/maths",
    "title": "Maths",
    "description": "This section provides an overview of Introduction.",
    "content": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime, molestiae, facilis aperiam et, error illum vel ullam? Quis architecto dolore ullam\n\n## Basic Algebra\n\nThe area of a circle ($$A$$) can be calculated using the radius ($$r$$) as follows:\n\n```math\nA = \\pi r^2\n```\n\n## Quadratic Formula\n\nThe quadratic formula for solving an equation of the form $$ax^2 + bx + c = 0$$ is:\n\n```math\nx = \\frac{-b \\pm \\sqrt{b^2 - 4ac}}{2a}\n```\n\n## Newton's Second Law of Motion\n\nNewton's second law of motion states that force ($$F$$) is the product of mass ($$m$$) and acceleration ($$a$$):\n\n```math\nF = ma\n```\n\n## Pythagorean Theorem\n\nThe Pythagorean theorem relates the lengths of the sides of a right triangle:\n\n```math\na^2 + b^2 = c^2\n```\n\n## Einstein's Mass-Energy Equivalence\n\nEinstein's famous equation relates energy ($$E$$), mass ($$m$$), and the speed of light ($$c$$):\n\n```math\nE = mc^2\n```\n",
    "_searchMeta": {
      "cleanContent": "lorem ipsum dolor sit amet consectetur adipisicing elit numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime molestiae facilis aperiam et error illum vel ullam quis architecto dolore ullam basic algebra the area of a circle a can be calculated using the radius r as follows: quadratic formula the quadratic formula for solving an equation of the form ax 2 bx c 0 is: newton s second law of motion newton s second law of motion states that force f is the product of mass m and acceleration a : pythagorean theorem the pythagorean theorem relates the lengths of the sides of a right triangle: einstein s mass-energy equivalence einstein s famous equation relates energy e mass m and the speed of light c :",
      "headings": [
        "Basic Algebra",
        "Quadratic Formula",
        "Newton's Second Law of Motion",
        "Pythagorean Theorem",
        "Einstein's Mass-Energy Equivalence"
      ],
      "keywords": [
        "Basic Algebra",
        "Quadratic Formula",
        "Newton's Second Law of Motion",
        "Pythagorean Theorem",
        "Einstein's Mass-Energy Equivalence",
        "math\nA = \\pi r^2",
        "## Quadratic Formula\n\nThe quadratic formula for solving an equation of the form $$ax^2 + bx + c = 0$$ is:",
        "math\nx = \\frac{-b \\pm \\sqrt{b^2 - 4ac}}{2a}",
        "## Newton's Second Law of Motion\n\nNewton's second law of motion states that force ($$F$$) is the product of mass ($$m$$) and acceleration ($$a$$):",
        "math\nF = ma",
        "## Pythagorean Theorem\n\nThe Pythagorean theorem relates the lengths of the sides of a right triangle:",
        "math\na^2 + b^2 = c^2",
        "## Einstein's Mass-Energy Equivalence\n\nEinstein's famous equation relates energy ($$E$$), mass ($$m$$), and the speed of light ($$c$$):",
        "math\nE = mc^2"
      ]
    }
  },
  {
    "slug": "/markdown/notes",
    "title": "Notes",
    "description": "This section provides an overview of Introduction.",
    "content": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime, molestiae, facilis aperiam et, error illum vel ullam? Quis architecto dolore ullam\n\n## Standard Note\n\n## Success Note\n\n## Warning Note\n\n## Danger Note\n",
    "_searchMeta": {
      "cleanContent": "lorem ipsum dolor sit amet consectetur adipisicing elit numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime molestiae facilis aperiam et error illum vel ullam quis architecto dolore ullam standard note success note warning note danger note",
      "headings": [
        "Standard Note",
        "Success Note",
        "Warning Note",
        "Danger Note"
      ],
      "keywords": [
        "Standard Note",
        "Success Note",
        "Warning Note",
        "Danger Note"
      ]
    }
  },
  {
    "slug": "/markdown/steps",
    "title": "Steps",
    "description": "This section provides an overview of Introduction.",
    "content": "The `<Step>` and `<StepItem>` components allow you to create structured step-by-step guides in your documentation. These components are particularly useful when you want to break down a process or tutorial into easy-to-follow stages.\n\n## Steps\n\nTo create a step-by-step guide in your MDX, you can use the following structure:\n",
    "_searchMeta": {
      "cleanContent": "the step and stepitem components allow you to create structured step-by-step guides in your documentation these components are particularly useful when you want to break down a process or tutorial into easy-to-follow stages steps to create a step-by-step guide in your mdx you can use the following structure:",
      "headings": [
        "Steps"
      ],
      "keywords": [
        "Steps",
        "<Step>",
        "<StepItem>"
      ]
    }
  },
  {
    "slug": "/markdown/table",
    "title": "Table",
    "description": "This section provides an overview of Introduction.",
    "content": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime, molestiae, facilis aperiam et, error illum vel ullam? Quis architecto dolore ullam\n\n| Syntax        | Description |   Test Text |\r\n| :------------ | :---------: | ----------: |\r\n| Header        |    Title    | Here's this |\r\n| Paragraph     |    Text     |    And more |\r\n| Strikethrough |             |    ~~Text~~ |\n\n| Feature       | Documentation Link |                    Notes |\r\n| :------------ | :----------------: | -----------------------: |\r\n| **Feature A** |     [Docs](#)      | For more info click here |\r\n| **Feature B** |     [Guide](#)     |  See the full guide here |\r\n| **Feature C** |     [Setup](#)     |       Setup instructions |\n",
    "_searchMeta": {
      "cleanContent": "lorem ipsum dolor sit amet consectetur adipisicing elit numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime molestiae facilis aperiam et error illum vel ullam quis architecto dolore ullam syntax description test text :------------ :---------: ----------: header title here s this paragraph text and more strikethrough text feature documentation link notes :------------ :----------------: -----------------------: feature a docs for more info click here feature b guide see the full guide here feature c setup setup instructions",
      "headings": [],
      "keywords": [
        "Feature A",
        "Feature B",
        "Feature C"
      ]
    }
  },
  {
    "slug": "/markdown/tabs",
    "title": "Tabs",
    "description": "This section provides an overview of Introduction.",
    "content": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime, molestiae, facilis aperiam et, error illum vel ullam? Quis architecto dolore ullam\n\n## Code Examples with switch\n\nHere a custom tab component from shadcn ui is used.\n",
    "_searchMeta": {
      "cleanContent": "lorem ipsum dolor sit amet consectetur adipisicing elit numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime molestiae facilis aperiam et error illum vel ullam quis architecto dolore ullam code examples with switch here a custom tab component from shadcn ui is used",
      "headings": [
        "Code Examples with switch"
      ],
      "keywords": [
        "Code Examples with switch"
      ]
    }
  },
  {
    "slug": "/navigation",
    "title": "Navigation",
    "description": "How to build our your documents menu and navigations.",
    "content": "",
    "_searchMeta": {
      "cleanContent": "",
      "headings": [],
      "keywords": [
        "navigation",
        "sidebar",
        "menus",
        "mdx",
        "nextjs",
        "documents"
      ]
    }
  },
  {
    "slug": "/pengantar",
    "title": "Pengantar",
    "description": "",
    "content": "![Banner](/images/banner-pengantar.png \"Pengantar\")\n\nDi tengah pesatnya perkembangan teknologi, peran guru tidak hanya sebagai penyampai ilmu, tetapi juga sebagai inovator yang mampu merancang pengalaman belajar yang relevan dan menarik bagi generasi Z. Salah satu instrumen paling kuat yang kini berada di genggaman kita adalah video pendek. Format yang seringkali dianggap sekadar hiburan ini sesungguhnya menyimpan potensi pedagogis yang luar biasa jika dimanfaatkan dengan tepat.\n\nModul ini dirancang sebagai buku saku digital yang komprehensif untuk memandu Bapak/Ibu guru dalam memahami, merancang, memproduksi, dan mengimplementasikan video pendek sebagai media pembelajaran berbasis web. Dari landasan teoretis hingga panduan teknis langkah demi langkah, modul ini bertujuan untuk membekali para guru madrasah dengan keterampilan dan kepercayaan diri untuk bertransformasi dari konsumen konten menjadi produsen konten edukasi yang berdampak. Mari bersama-sama kita jelajahi bagaimana video berdurasi singkat dapat membuka pintu menuju pemahaman yang lebih dalam dan kecintaan belajar yang lebih besar bagi siswa-siswi kita.\n\nDunia pendidikan terus berevolusi seiring dengan perkembangan teknologi. Salah satu fenomena paling signifikan dalam lanskap media digital saat ini adalah dominasi video berdurasi pendek atau biasa disebut *shorts*. Format ini, yang dipopulerkan oleh platform seperti TikTok, Instagram Reels, dan YouTube Shorts, telah mengubah cara informasi dibuat, dikonsumsi, dan dibagikan. Bagi para pendidik, memahami medium baru ini bukan lagi sekadar pilihan, melainkan sebuah keharusan untuk tetap relevan dan efektif dalam menjangkau siswa di era digital. Bagian ini akan mengupas fondasi dari video pendek, mulai dari definisi dan karakteristiknya, alasan di balik popularitasnya yang masif, hingga perbedaannya dengan video format panjang dalam konteks pembelajaran.\n\n> *\"Media short video learning (pembelajaran menggunakan video pendek) merupakan evolusi pembelajaran digital yang menawarkan konten video dalam potongan-potongan lebih pendek dan mudah dicerna. Video pendek yang durasinya kurang dari 7 menit lebih efektif dalam meningkatkan keterlibatan siswa dibanding dengan video yang lebih panjang, hal ini menunjukkan potensi besar short video learning dalam meningkatkan efektifitas pembelajaran.\"* - [Sukmawati (Pemanfaatan Media Short Video Learning untuk Mendukung Pembelajaran Metode Self-Paced Learning)](https://jer.or.id/index.php/jer/article/view/1935)\n\n<div class=\"rounded-md border px-3.5 py-0.5 text-sm tracking-wide dark:bg-green-950 bg-green-100 border-green-300 dark:border-green-900\">\n  <p class=\"-mb-3 text-sm font-semibold\">Format microlearning yang ringkas terbukti lebih efektif dalam dunia pendidikan modern</p>\n</div>\n\n## Mulai Membuat Video Pendek\n",
    "_searchMeta": {
      "cleanContent": "banner di tengah pesatnya perkembangan teknologi peran guru tidak hanya sebagai penyampai ilmu tetapi juga sebagai inovator yang mampu merancang pengalaman belajar yang relevan dan menarik bagi generasi z salah satu instrumen paling kuat yang kini berada di genggaman kita adalah video pendek format yang seringkali dianggap sekadar hiburan ini sesungguhnya menyimpan potensi pedagogis yang luar biasa jika dimanfaatkan dengan tepat modul ini dirancang sebagai buku saku digital yang komprehensif untuk memandu bapak ibu guru dalam memahami merancang memproduksi dan mengimplementasikan video pendek sebagai media pembelajaran berbasis web dari landasan teoretis hingga panduan teknis langkah demi langkah modul ini bertujuan untuk membekali para guru madrasah dengan keterampilan dan kepercayaan diri untuk bertransformasi dari konsumen konten menjadi produsen konten edukasi yang berdampak mari bersama-sama kita jelajahi bagaimana video berdurasi singkat dapat membuka pintu menuju pemahaman yang lebih dalam dan kecintaan belajar yang lebih besar bagi siswa-siswi kita dunia pendidikan terus berevolusi seiring dengan perkembangan teknologi salah satu fenomena paling signifikan dalam lanskap media digital saat ini adalah dominasi video berdurasi pendek atau biasa disebut shorts format ini yang dipopulerkan oleh platform seperti tiktok instagram reels dan youtube shorts telah mengubah cara informasi dibuat dikonsumsi dan dibagikan bagi para pendidik memahami medium baru ini bukan lagi sekadar pilihan melainkan sebuah keharusan untuk tetap relevan dan efektif dalam menjangkau siswa di era digital bagian ini akan mengupas fondasi dari video pendek mulai dari definisi dan karakteristiknya alasan di balik popularitasnya yang masif hingga perbedaannya dengan video format panjang dalam konteks pembelajaran media short video learning pembelajaran menggunakan video pendek merupakan evolusi pembelajaran digital yang menawarkan konten video dalam potongan-potongan lebih pendek dan mudah dicerna video pendek yang durasinya kurang dari 7 menit lebih efektif dalam meningkatkan keterlibatan siswa dibanding dengan video yang lebih panjang hal ini menunjukkan potensi besar short video learning dalam meningkatkan efektifitas pembelajaran - sukmawati pemanfaatan media short video learning untuk mendukung pembelajaran metode self-paced learning div class rounded-md border px-3 5 py-0 5 text-sm tracking-wide dark:bg-green-950 bg-green-100 border-green-300 dark:border-green-900 p class -mb-3 text-sm font-semibold format microlearning yang ringkas terbukti lebih efektif dalam dunia pendidikan modern p div mulai membuat video pendek",
      "headings": [
        "Mulai Membuat Video Pendek"
      ],
      "keywords": [
        "Mulai Membuat Video Pendek"
      ]
    }
  },
  {
    "slug": "/random",
    "title": "Introduction",
    "description": "This section provides an overview of Introduction.",
    "content": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime, molestiae, facilis aperiam et, error illum vel ullam? Quis architecto dolore ullam\n\n* \\[x] Write the press release\n* \\[ ] Update the website\n* \\[ ] Contact the media\n\n| Syntax        | Description |   Test Text |\r\n| :------------ | :---------: | ----------: |\r\n| Header        |    Title    | Here's this |\r\n| Paragraph     |    Text     |    And more |\r\n| Strikethrough |             |    ~~Text~~ |\n\n## Getting Started\n\nTo begin using the Documentation Template, follow these simple steps:\n\n* Start by cloning the repository to your local machine.\n\nLorem ipsum dolor sit amet consectetur adipisicing elit. Reprehenderit quae iure nulla deserunt dolore quam pariatur minus sapiente accusantium. Optio, necessitatibus sequi. Veritatis, aspernatur? Possimus quis repellat eum vitae eveniet.\n\n## Blockquotes\n\nBlockquotes are useful for emphasizing key points or quoting external sources:\n\n> \"Documentation is a love letter that you write to your future self.\" - Damian Conway\n\nFeel free to use blockquotes to highlight important information or quotes relevant to your documentation.\n\n## Code Examples with switch\n\nHere a custom tab component from shadcn ui is used.\n\n## Conclusion\n\nAdding some random stuff to change the code\n",
    "_searchMeta": {
      "cleanContent": "lorem ipsum dolor sit amet consectetur adipisicing elit numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime molestiae facilis aperiam et error illum vel ullam quis architecto dolore ullam x write the press release update the website contact the media syntax description test text :------------ :---------: ----------: header title here s this paragraph text and more strikethrough text getting started to begin using the documentation template follow these simple steps: start by cloning the repository to your local machine lorem ipsum dolor sit amet consectetur adipisicing elit reprehenderit quae iure nulla deserunt dolore quam pariatur minus sapiente accusantium optio necessitatibus sequi veritatis aspernatur possimus quis repellat eum vitae eveniet blockquotes blockquotes are useful for emphasizing key points or quoting external sources: documentation is a love letter that you write to your future self - damian conway feel free to use blockquotes to highlight important information or quotes relevant to your documentation code examples with switch here a custom tab component from shadcn ui is used conclusion adding some random stuff to change the code",
      "headings": [
        "Getting Started",
        "Blockquotes",
        "Code Examples with switch",
        "Conclusion"
      ],
      "keywords": [
        "Getting Started",
        "Blockquotes",
        "Code Examples with switch",
        "Conclusion"
      ]
    }
  },
  {
    "slug": "/structure/deep/deeper/even-deeper",
    "title": "Introduction",
    "description": "This section provides an overview of Introduction.",
    "content": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime, molestiae, facilis aperiam et, error illum vel ullam? Quis architecto dolore ullam\n\n* \\[x] Write the press release\n* \\[ ] Update the website\n* \\[ ] Contact the media\n\n| Syntax        | Description |   Test Text |\r\n| :------------ | :---------: | ----------: |\r\n| Header        |    Title    | Here's this |\r\n| Paragraph     |    Text     |    And more |\r\n| Strikethrough |             |    ~~Text~~ |\n",
    "_searchMeta": {
      "cleanContent": "lorem ipsum dolor sit amet consectetur adipisicing elit numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime molestiae facilis aperiam et error illum vel ullam quis architecto dolore ullam x write the press release update the website contact the media syntax description test text :------------ :---------: ----------: header title here s this paragraph text and more strikethrough text",
      "headings": [],
      "keywords": []
    }
  },
  {
    "slug": "/structure/deep/deeper",
    "title": "Introduction",
    "description": "This section provides an overview of Introduction.",
    "content": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime, molestiae, facilis aperiam et, error illum vel ullam? Quis architecto dolore ullam\n\n* \\[x] Write the press release\n* \\[ ] Update the website\n* \\[ ] Contact the media\n\n| Syntax        | Description |   Test Text |\r\n| :------------ | :---------: | ----------: |\r\n| Header        |    Title    | Here's this |\r\n| Paragraph     |    Text     |    And more |\r\n| Strikethrough |             |    ~~Text~~ |\n\n## Getting Started\n\nTo begin using the Documentation Template, follow these simple steps:\n\n* Start by cloning the repository to your local machine.\n\nLorem ipsum dolor sit amet consectetur adipisicing elit. Reprehenderit quae iure nulla deserunt dolore quam pariatur minus sapiente accusantium. Optio, necessitatibus sequi. Veritatis, aspernatur? Possimus quis repellat eum vitae eveniet.\n\n## Blockquotes\n\nBlockquotes are useful for emphasizing key points or quoting external sources:\n\n> \"Documentation is a love letter that you write to your future self.\" - Damian Conway\n\nFeel free to use blockquotes to highlight important information or quotes relevant to your documentation.\n\n## Code Examples with switch\n\nHere a custom tab component from shadcn ui is used.\n\n## Conclusion\n\nThank you for choosing the Documentation Template for your project. Whether you're documenting software, APIs, or processes, we're here to support you in creating clear and effective documentation. Happy documenting!\n\n## Tabs Example\n",
    "_searchMeta": {
      "cleanContent": "lorem ipsum dolor sit amet consectetur adipisicing elit numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime molestiae facilis aperiam et error illum vel ullam quis architecto dolore ullam x write the press release update the website contact the media syntax description test text :------------ :---------: ----------: header title here s this paragraph text and more strikethrough text getting started to begin using the documentation template follow these simple steps: start by cloning the repository to your local machine lorem ipsum dolor sit amet consectetur adipisicing elit reprehenderit quae iure nulla deserunt dolore quam pariatur minus sapiente accusantium optio necessitatibus sequi veritatis aspernatur possimus quis repellat eum vitae eveniet blockquotes blockquotes are useful for emphasizing key points or quoting external sources: documentation is a love letter that you write to your future self - damian conway feel free to use blockquotes to highlight important information or quotes relevant to your documentation code examples with switch here a custom tab component from shadcn ui is used conclusion thank you for choosing the documentation template for your project whether you re documenting software apis or processes we re here to support you in creating clear and effective documentation happy documenting tabs example",
      "headings": [
        "Getting Started",
        "Blockquotes",
        "Code Examples with switch",
        "Conclusion",
        "Tabs Example"
      ],
      "keywords": [
        "Getting Started",
        "Blockquotes",
        "Code Examples with switch",
        "Conclusion",
        "Tabs Example"
      ]
    }
  },
  {
    "slug": "/structure/deep",
    "title": "Introduction",
    "description": "This section provides an overview of Introduction.",
    "content": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime, molestiae, facilis aperiam et, error illum vel ullam? Quis architecto dolore ullam\n\n* \\[x] Write the press release\n* \\[ ] Update the website\n* \\[ ] Contact the media\n\n| Syntax        | Description |   Test Text |\r\n| :------------ | :---------: | ----------: |\r\n| Header        |    Title    | Here's this |\r\n| Paragraph     |    Text     |    And more |\r\n| Strikethrough |             |    ~~Text~~ |\n\n## Getting Started\n\nTo begin using the Documentation Template, follow these simple steps:\n\n* Start by cloning the repository to your local machine.\n\nLorem ipsum dolor sit amet consectetur adipisicing elit. Reprehenderit quae iure nulla deserunt dolore quam pariatur minus sapiente accusantium. Optio, necessitatibus sequi. Veritatis, aspernatur? Possimus quis repellat eum vitae eveniet.\n\n## Blockquotes\n\nBlockquotes are useful for emphasizing key points or quoting external sources:\n\n> \"Documentation is a love letter that you write to your future self.\" - Damian Conway\n\nFeel free to use blockquotes to highlight important information or quotes relevant to your documentation.\n\n## Code Examples with switch\n\nHere a custom tab component from shadcn ui is used.\n\n## Conclusion\n\nThank you for choosing the Documentation Template for your project. Whether you're documenting software, APIs, or processes, we're here to support you in creating clear and effective documentation. Happy documenting!\n\n## Tabs Example\n",
    "_searchMeta": {
      "cleanContent": "lorem ipsum dolor sit amet consectetur adipisicing elit numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime molestiae facilis aperiam et error illum vel ullam quis architecto dolore ullam x write the press release update the website contact the media syntax description test text :------------ :---------: ----------: header title here s this paragraph text and more strikethrough text getting started to begin using the documentation template follow these simple steps: start by cloning the repository to your local machine lorem ipsum dolor sit amet consectetur adipisicing elit reprehenderit quae iure nulla deserunt dolore quam pariatur minus sapiente accusantium optio necessitatibus sequi veritatis aspernatur possimus quis repellat eum vitae eveniet blockquotes blockquotes are useful for emphasizing key points or quoting external sources: documentation is a love letter that you write to your future self - damian conway feel free to use blockquotes to highlight important information or quotes relevant to your documentation code examples with switch here a custom tab component from shadcn ui is used conclusion thank you for choosing the documentation template for your project whether you re documenting software apis or processes we re here to support you in creating clear and effective documentation happy documenting tabs example",
      "headings": [
        "Getting Started",
        "Blockquotes",
        "Code Examples with switch",
        "Conclusion",
        "Tabs Example"
      ],
      "keywords": [
        "Getting Started",
        "Blockquotes",
        "Code Examples with switch",
        "Conclusion",
        "Tabs Example"
      ]
    }
  },
  {
    "slug": "/structure",
    "title": "Structure",
    "description": "This section provides an overview of Introduction.",
    "content": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime, molestiae, facilis aperiam et, error illum vel ullam? Quis architecto dolore ullam\n\n* \\[x] Write the press release\n* \\[ ] Update the website\n* \\[ ] Contact the media\n\n| Syntax        | Description |   Test Text |\r\n| :------------ | :---------: | ----------: |\r\n| Header        |    Title    | Here's this |\r\n| Paragraph     |    Text     |    And more |\r\n| Strikethrough |             |    ~~Text~~ |\n\n## Getting Started\n\nTo begin using the Documentation Template, follow these simple steps:\n\n* Start by cloning the repository to your local machine.\n\nLorem ipsum dolor sit amet consectetur adipisicing elit. Reprehenderit quae iure nulla deserunt dolore quam pariatur minus sapiente accusantium. Optio, necessitatibus sequi. Veritatis, aspernatur? Possimus quis repellat eum vitae eveniet.\n\n## Blockquotes\n\nBlockquotes are useful for emphasizing key points or quoting external sources:\n\n> \"Documentation is a love letter that you write to your future self.\" - Damian Conway\n\nFeel free to use blockquotes to highlight important information or quotes relevant to your documentation.\n\n## Code Examples with switch\n\nHere a custom tab component from shadcn ui is used.\n\n## Conclusion\n\nThank you for choosing the Documentation Template for your project. Whether you're documenting software, APIs, or processes, we're here to support you in creating clear and effective documentation. Happy documenting!\n",
    "_searchMeta": {
      "cleanContent": "lorem ipsum dolor sit amet consectetur adipisicing elit numquam iste dolorum tempore consectetur explicabo tempora provident quia maxime molestiae facilis aperiam et error illum vel ullam quis architecto dolore ullam x write the press release update the website contact the media syntax description test text :------------ :---------: ----------: header title here s this paragraph text and more strikethrough text getting started to begin using the documentation template follow these simple steps: start by cloning the repository to your local machine lorem ipsum dolor sit amet consectetur adipisicing elit reprehenderit quae iure nulla deserunt dolore quam pariatur minus sapiente accusantium optio necessitatibus sequi veritatis aspernatur possimus quis repellat eum vitae eveniet blockquotes blockquotes are useful for emphasizing key points or quoting external sources: documentation is a love letter that you write to your future self - damian conway feel free to use blockquotes to highlight important information or quotes relevant to your documentation code examples with switch here a custom tab component from shadcn ui is used conclusion thank you for choosing the documentation template for your project whether you re documenting software apis or processes we re here to support you in creating clear and effective documentation happy documenting",
      "headings": [
        "Getting Started",
        "Blockquotes",
        "Code Examples with switch",
        "Conclusion"
      ],
      "keywords": [
        "Getting Started",
        "Blockquotes",
        "Code Examples with switch",
        "Conclusion"
      ]
    }
  }
]